SadPinguu/STM32_SinFromPWM/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_sdram.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_lcd.h"
#include "stdio.h"
#include "math.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
// Definicje przycisków i pozycji tekstu
#define SHIFT 55

#define BUTTON_WIDTH (100 + SHIFT)
#define BUTTON_HEIGHT 50
#define BUTTON_SPACING 10

#define BUTTON_ON_OFF_X 20
#define BUTTON_ON_OFF_Y 20

#define BUTTON_MODE_X 20
#define BUTTON_MODE_Y (BUTTON_ON_OFF_Y + BUTTON_HEIGHT + BUTTON_SPACING)

#define BUTTON_AMPLITUDE_UP_X 20
#define BUTTON_AMPLITUDE_UP_Y (BUTTON_MODE_Y + BUTTON_HEIGHT + BUTTON_SPACING)

#define BUTTON_AMPLITUDE_DOWN_X 20
#define BUTTON_AMPLITUDE_DOWN_Y (BUTTON_AMPLITUDE_UP_Y + BUTTON_HEIGHT + BUTTON_SPACING)

#define TEXT_OFFSET_X (140 + SHIFT)
#define TEXT_OFFSET_Y 20
#define TEXT_SPACING 30

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;
DMA_HandleTypeDef hdma_adc3;

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

LTDC_HandleTypeDef hltdc;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim5;

UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */
uint16_t tikTak1 = 1, tikTak2 = 1, tikTak3 = 1, tikTak4 = 1;

int16_t dmaBuffor[4];
float adcAvg = 0;

TS_StateTypeDef ts;
char xTouchStr[10];

uint8_t stan = 0;

uint16_t tim2IntTimes = 0;
float SinPeriodOffset = 6.28 / 2500;
uint32_t sinTable[200];

TS_StateTypeDef TS_State;
char xTouchStr[10];

uint8_t signal_on = 0;
uint8_t generation_mode = 1;
uint8_t fundamental_amplitude = 50;
uint8_t harmonic_amplitude = 50;

uint8_t harmonic = 3;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_LTDC_Init(void);
static void MX_TIM2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_TIM5_Init(void);
/* USER CODE BEGIN PFP */
static void CreateSinTable(void);
void ProcessTouch(uint16_t x, uint16_t y);
void UpdateDisplay();
void DrawButtons(void);
void InitDisplay();

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_DMA2D_Init();
  MX_FMC_Init();
  MX_LTDC_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_TIM5_Init();
  /* USER CODE BEGIN 2 */
  CreateSinTable();
  //HAL_TIM_PWM_Start_IT(&htim2, TIM_CHANNEL_1);
  //HAL_TIM_PWM_Start_IT(&htim5, TIM_CHANNEL_1);
  //HAL_ADC_Start_DMA(&hadc3, dmaBuffor, 4);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  InitDisplay();
  while (1)
    {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

  	  if((uwTick % 2U) == 0U) //co 1ms
  	  	  {
  	  	 	  tikTak1++;
  	  	 	  tikTak2++;
  	  	 	  tikTak3++;
  	  	 	  tikTak4++;
  	  	 	  uwTick = 1;

  	  	 	  HAL_ADC_Start_IT(&hadc3);
  	  	 	  //////// SREDNIA DO ZADANA 9 /////////
  	  	 	  //adcAvg = 0;
  	  	 	  float tmpAvg = 0;
  	  	 	  for(int i=0; i<4; i++) {
  	  	 		 float tmp = dmaBuffor[i];
  	  	 		 tmpAvg += tmp / 4095.0;
  	  	 	  }
  	  	 	 tmpAvg /= 4U;
  	  	 	 adcAvg = tmpAvg;

  	  	 	 if (adcAvg < 0.05) {
  	  	 		 adcAvg = 0.05;
  	  	 	 } else if (adcAvg > 0.9) {
  	  	 		 adcAvg = 0.9;
  	  	 	 }

  	  	 	 harmonic_amplitude = adcAvg * 100;
  	  	 	  ////////////////KONIEC SREDNIA //////////
  	  	  }

  	  	  if((tikTak1 % 11) == 0) //co 10ms sie zmienia
  	  	  {
  	  		  //HAL_GPIO_TogglePin(GPIOB, LedH4_Pin);
  	  		  tikTak1 = 1;
  	  		  //HAL_ADC_Start_DMA(&hadc3, dmaBuffor, 4);
  	  	  }
  	  	  if((tikTak2 % 101U) == 0) // co 100ms
  	      {
  	  		  HAL_GPIO_TogglePin(GPIOG, LedH5_Pin);
  	  		  tikTak2 = 1;

  	  		  BSP_TS_GetState(&TS_State);
  	  		  if (TS_State.touchDetected) { //tutaj dodać lub po zmianie wartości odczytanej z potencjometru
  	  			  ProcessTouch(TS_State.touchX[0], TS_State.touchY[0]);
  	  		  }
  	  		  UpdateDisplay();
  	  	  }
  	  	  if((tikTak3 % 1001U) == 0U) //co 1000ms (1s)
  	  	  {
  	  	  	  HAL_GPIO_TogglePin(LedH6_GPIO_Port, LedH6_Pin);
  	  	  	  tikTak3 = 1;
  	  	  }
  	  	  if((tikTak4 % 10001U) == 0U) //co 10 000ms
  	  	  {
  	  	   	  tikTak4 = 1;
  	  	  }



