SadPinguu/STM32_SinFromPWM/Core/Src/main.c
  /*Configure GPIO pin : LedH4_Pin */
  GPIO_InitStruct.Pin = LedH4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LedH4_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LedH6_Pin */
  GPIO_InitStruct.Pin = LedH6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LedH6_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LedH5_Pin */
  GPIO_InitStruct.Pin = LedH5_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LedH5_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
static void CreateSinTable()
{
	float tmp = 6.28 / 200;
	int i = 0;
	for(i = 0; i < 200; i++)
	{
		sinTable[i] = 990 * (sin(tmp * i) + 1);


		if(sinTable[i] > PWM_MAX_VALUE) { sinTable[i] = PWM_MAX_VALUE; }
		else if (sinTable[i] < PWM_MIN_VALUE) { sinTable[i] = PWM_MIN_VALUE; }
	}
}


void InitDisplay() {
    // Inicjalizacja LCD
    BSP_LCD_Init();
    BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);
    BSP_LCD_SelectLayer(0);
    BSP_LCD_Clear(LCD_COLOR_WHITE);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_SetFont(&Font24);

    // Inicjalizacja ekranu dotykowego
    BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());

    // Rysowanie przycisków
    DrawButtons();

    // Aktualizacja wyświetlanych wartości
    UpdateDisplay();
}

void DrawButtons(void) {
    // Rysowanie przycisku On/Off
    BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
    BSP_LCD_FillRect(BUTTON_ON_OFF_X, BUTTON_ON_OFF_Y, BUTTON_WIDTH, BUTTON_HEIGHT);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DisplayStringAt(BUTTON_ON_OFF_X + 10, BUTTON_ON_OFF_Y + 15, (uint8_t *)"On/Off", LEFT_MODE);

    // Rysowanie przycisku Tryb
    BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(BUTTON_MODE_X, BUTTON_MODE_Y, BUTTON_WIDTH, BUTTON_HEIGHT);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DisplayStringAt(BUTTON_MODE_X + 10, BUTTON_MODE_Y + 15, (uint8_t *)"Tryb", LEFT_MODE);

    // Rysowanie przycisku Amplituda Up
    BSP_LCD_SetTextColor(LCD_COLOR_RED);
    BSP_LCD_FillRect(BUTTON_AMPLITUDE_UP_X, BUTTON_AMPLITUDE_UP_Y, BUTTON_WIDTH, BUTTON_HEIGHT);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DisplayStringAt(BUTTON_AMPLITUDE_UP_X + 10, BUTTON_AMPLITUDE_UP_Y + 15, (uint8_t *)"Amp 1h +", LEFT_MODE);

    // Rysowanie przycisku Amplituda Down
    BSP_LCD_SetTextColor(LCD_COLOR_RED);
    BSP_LCD_FillRect(BUTTON_AMPLITUDE_DOWN_X, BUTTON_AMPLITUDE_DOWN_Y, BUTTON_WIDTH, BUTTON_HEIGHT);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DisplayStringAt(BUTTON_AMPLITUDE_DOWN_X + 10, BUTTON_AMPLITUDE_DOWN_Y + 15, (uint8_t *)"Amp 1h -", LEFT_MODE);
}

void UpdateDisplay() {
    char buffer[30];

    // Wyświetlanie stanu sygnału
    sprintf(buffer, "Sygnal: %s", signal_on ? "On " : "Off");
    BSP_LCD_DisplayStringAt(TEXT_OFFSET_X, TEXT_OFFSET_Y, (uint8_t *)buffer, LEFT_MODE);

    // Wyświetlanie trybu generacji
    sprintf(buffer, "Tryb: %s", generation_mode ? "1+3h" : "1+5h");
    BSP_LCD_DisplayStringAt(TEXT_OFFSET_X, TEXT_OFFSET_Y + TEXT_SPACING, (uint8_t *)buffer, LEFT_MODE);

    // Wyświetlanie amplitudy podstawowej harmonicznej
    sprintf(buffer, "Amp. 1h: %.3d%%", fundamental_amplitude);
    BSP_LCD_DisplayStringAt(TEXT_OFFSET_X, TEXT_OFFSET_Y + 2 * TEXT_SPACING, (uint8_t *)buffer, LEFT_MODE);

    // Wyświetlanie amplitudy drugiej harmonicznej
    sprintf(buffer, "Amp. %s: %.3d%%", generation_mode ? "3h" : "5h", harmonic_amplitude);
    BSP_LCD_DisplayStringAt(TEXT_OFFSET_X, TEXT_OFFSET_Y + 3 * TEXT_SPACING, (uint8_t *)buffer, LEFT_MODE);
}

void ProcessTouch(uint16_t x, uint16_t y) {
    if (x > BUTTON_ON_OFF_X && x < BUTTON_ON_OFF_X + BUTTON_WIDTH &&
        y > BUTTON_ON_OFF_Y && y < BUTTON_ON_OFF_Y + BUTTON_HEIGHT) {
        signal_on = !signal_on;
        if (signal_on == 1) {
        	HAL_GPIO_WritePin(GPIOB, LedH4_Pin, 1);

        	HAL_TIM_PWM_Start_IT(&htim5, TIM_CHANNEL_1);
        } else {
        	HAL_GPIO_WritePin(GPIOB, LedH4_Pin, 0);

        	HAL_TIM_PWM_Stop_IT(&htim5, TIM_CHANNEL_1);
        }
    } else if (x > BUTTON_MODE_X && x < BUTTON_MODE_X + BUTTON_WIDTH &&
               y > BUTTON_MODE_Y && y < BUTTON_MODE_Y + BUTTON_HEIGHT) {
        generation_mode = !generation_mode;
        if (generation_mode == 1) {
        	harmonic = 3;
        } else {
        	harmonic = 5;
        }
    } else if (x > BUTTON_AMPLITUDE_UP_X && x < BUTTON_AMPLITUDE_UP_X + BUTTON_WIDTH &&
               y > BUTTON_AMPLITUDE_UP_Y && y < BUTTON_AMPLITUDE_UP_Y + BUTTON_HEIGHT) {
        if (fundamental_amplitude < 100) {
            fundamental_amplitude += 10;
        }
    } else if (x > BUTTON_AMPLITUDE_DOWN_X && x < BUTTON_AMPLITUDE_DOWN_X + BUTTON_WIDTH &&
               y > BUTTON_AMPLITUDE_DOWN_Y && y < BUTTON_AMPLITUDE_DOWN_Y + BUTTON_HEIGHT) {
        if (fundamental_amplitude > 10) {
            fundamental_amplitude -= 10;
        }
    }
    // Aktualizacja wyświetlanych wartości
    UpdateDisplay();
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
